import React from "react";

const Aboutme = () => {
  return (
    <article>
      <img className="infoimg" src="Semin.jpg" alt="SeminPic" />
      <div className="textbox">
        <p>
          <a
            style={{ margin: "none !important" }}
            target="_blank"
            href="https://www.notion.so/c36e820b437348618f728d07e86a7873?pvs=9"
          >
            <img src="https://img.shields.io/badge/notion-000000?style=for-the-badge&logo=notion&logoColor=white" />
          </a>
          <a
            style={{ margin: "none !important" }}
            target="_blank"
            href="https://github.com/SMZZOL"
          >
            <img src="https://img.shields.io/badge/github-181717?style=for-the-badge&logo=github&logoColor=white" />
          </a>
        </p>
      </div>
      <div class="textbox">
        <p>안녕하세요,</p>
        <p>성장을 최우선으로 생각하는</p>
        <p>신입 웹개발자 김세민 입니다. </p>
        <p>저의 장점은</p>
      </div>

      <div class="textbox">
        <p>기본기에 충실하되 항상 도전하는 것입니다.</p>
        <h6>
          유니티 쉐이더를 통해 불의 구현이나 복잡한 3D 모델링 등을 학습하면서,
          그 3D모델의 현란함도 좋았지만 화려하지 않아도 기초가 되는 쉐이더 그
          자체의 원리나 색다른 접근 방법에 집중하여, 랜더링 수업임에도 해당
          결과물로 좋은 성적 을 내었습니다. 또한, DB와 관련된 강의를 수강 한 뒤
          SQL 활용법을 더 알아가고자 가상현실 전공임에도 최종 프로젝트를 DBMS를
          이용한 검색어 알고리즘을 하여 통과를 하는 등, 기본기임에도 다양한
          활용으로 좋은 성과를 거두었습니다.
        </h6>
        <br />
        <p>또,</p>
      </div>

      <div class="textbox">
        <h6>
          <p>최선을 노력하되 최악을 대비한다는 것입니다.</p>
          <br />
          전과 직후 방학에 수강한 웹개발 과정의 팀 프로젝트에서, 학기
          중이었음에도 새로운 것을 만들 수 있다는 기대감에 스스로를 과신한
          결과로 팀장을 맡아 하지 말아야할 실수를 했습니다. 모두가 열의를 가지고
          열심히 노력했지만, 저는 과도한 목표를 설정하고 한 두 가지의 기능을
          완벽하게 구현하려고 했기 때문에 다른 부분에 손도 못대었습니다. 이 경험
          이후, 최선의 결과를 얻기 위해 노력하면서도 항상 최악의 상황에 대비하는
          중요성을 깨달았습니다. 이로써 계획을 더 신중하게 세우게 되었고, 팀
          프로젝트에서 어느 정도의 하한선을 설정하면서 더 현실적인 목표를
          수립하게 되었습니다. 이러한 접근 방식은 이후 졸업 학기와 졸업 이후에도
          수행한 모든 팀 프로젝트 및 외부 교육에서 팀장으로 활동하며 프로젝트를
          성공적으로 완료하는 데 도움이 되었습니다.
        </h6>
      </div>
      <div class="textbox">
        <p>앞으로</p>
        <h6>
          팀 내에서 프로젝트를 수행할 때, 다양한 시각으로 성능을 개선하고
          창의적인 접근법을 제시하겠으나, 과한 목표를 설정하거나 너무 들뜨지
          않도록 신중하게 접근하겠습니다. 더불어, 빠르게 습득하고 배우며
          지속적으로 성장하겠습니다. 여행과 다양한 직종 경험을 통해 얻은 사회
          경험을 활용하여 협업 능력을 향상시키고, 에너지 넘치는 팀원으로서 낮은
          리스크와 높은 리턴을 창출하겠습니다.
        </h6>
      </div>
      <div class="textbox">
        <p>마지막으로 저의 성장 과정입니다.</p>
        <h6>
          우연히 학교 컴퓨터 시간에 스크래치라는 프로그램을 접하게 되었습니다.
          남들은 지루한 수업의 일부분 이였을 테지만, 나의 첫 조건문과 함수는
          너무나도 흥미로웠습니다. ios, 앱스토어 급 부상과 맞물린 그 시기에 나는
          어릴 적 경험과 아쉬웠던 점을 살려 미국으로 2주간 IOS Boot Camp에
          가기로 결심했습니다. 외지에서의 협동,낯선 사람들과의 발전적인 소통,
          합숙 등으로 끈끈해진 단합력을 통해 함께 결과를 만들어가는 일의 가치를
          알게되었습니다.이후 다양한 사람들과의 교류를 위해 학업을 제외한 모든
          시간을 아르바이트와 여행을 통해 시간을 보내기 시작했습니다. 이를 통해
          대부분의 상황에서 큰 마찰없이 동화되고 행여 갈등이 있다한들 중재자가
          되어 매끄럽게 그 모임의 목적을 달성 할 수 있는 적응력이
          생겼습니다.그러나 Boot Camp에서의 교류 경험을 찾는 것은 어려웠습니다.
          결국 여행 자체의 중요성 뿐만 아니라 목적 없는 친목과 소통보다도 그
          모임의 방향성이 더 중요하다는 것을 깨달았습니다. 그래서 마지막 여행을
          계기로 프로그래머로서의 꿈을 추구하고 학업에 전념하기로
          결심했습니다시작이 다소 늦게 느껴질 수 있지만, 무한한 가능성을 품은
          곳에서 함께 성장하고 싶은 열망은 변함이 없습니다.ㄴ
        </h6>
      </div>
    </article>
  );
};

export default Aboutme;
