import React from 'react'

const Aboutme = () => {
  return (
    <article>
    <img className="infoimg" src="Semin.jpg" alt="SeminPic" />
    <div class="textbox">
      <p>안녕하세요</p>
      <p>성장을 최우선으로 생각하는</p>
      <p>신입 웹개발자 김세민 입니다. </p>
      <p>저는...</p>
    </div>

    <div class="textbox">
      <h6>
        헤쳐나가지 못할 일은 없다 생각합니다. 어릴 적 우연이 참여하게 된
        게임 디자인 합숙 캠프를 통해 다양한 사람들과의 목적성 있는 교류의
        의미를 알게 되었습니다. 외지에서의 협동, 낯선사람들과의 발전적인
        소통, 합숙 등으로 끈끈해진 단합력을 통해 함께 결과를 만들어가는 일의
        가치를 느꼈던 것입니다. 이후 학업을 제외한 시간에는 아르바이트나
        여행을 통해 시간을 보내기 시작했습니다. 많은 아르바이트와 여행을
        통해 다양한 성격의 사람들과 어울려 봄으로써 적응력을 키웠습니다.
        이는 제가 각종 모임이나 프로젝트 참여시에 모두와 마찰없이 동화되고
        행여 갈등이 있다 한들 중재자가 되어 매끄럽게 그 모임의 목적을 달성
        할 수 있도록 도왔습니다. 대부분의 상황에서의 유연하고 침착한 대처를
        훈련한 저로써, 다른 사람들과의 협업을 할 때 높은 동화율과 친화력을
        바탕으로 업무적인 측면에서도 더욱이 좋은 효율을 낼 수 있다고
        생각합니다.
      </h6>
      <br />
      <p>또, 저의...</p>
    </div>

    <div class="textbox">
      <h6>
        <p>성격은..</p>
        기본적으로 실수를 통한 발전은 책임감에서부터 시작한다는 것입니다.
        <br />
        살며 하는 모든 일에 큰 제제가 없었지만 그에 대한 책임은 모두 저의 몫
        이였습니다. 학교에, 학업에 그 어떤 압박도 없이 저의 선택으로써
        앞길을 정하다 보니, 모든 결정에 신중해 졌습니다. 또한 제가 원하던
        결과가 나오지 않을 때, 저의 발전을 도모하는 계기로 삼았습니다. 어린
        나이에 레스토랑 매니저도, 파트타임이었던 편의점 아르바이트에 비중이
        늘어난 것도 실수 하나로도 발전하려 노력하는 저를 좋게 봐주신 듯
        합니다.학점과 전과를 위해 학원과 학교를 병행하던 시절 제 자신의
        의욕으로 프로젝트에 비교적 소홀하여 결론을 짓지 못하고 마무리가 된
        적이 있었습니다. 이 날을 기점으로, 다짐 만으로 책임 질 수 없다는
        것으로 깊이 깨닫고 이후에 진행하는 모든 프로젝트에서의 팀장을
        맡으면서도 객관화를 철저히 하여 최상은 아니더라도 최선의 결과물을
        내고자 신중을 가했고, 결론적으로 그 이후론 모두 성공적으로 마무리가
        되었습니다. 제가 행한 일이 좋은 성과를 거둘 땐 성취감과 뿌듯함으로,
        좋지 못한 결과를 거둘 땐 노력하리란 다짐과 발전의 마음으로 매사에
        임하고 있습니다. 모든 발전은 실패한 저를 인식하고 내적인 책임전가를
        피할 때 따라오는 것임을 알고 있습니다.
      </h6>
    </div>
    <div class="textbox">
      <p>장, 단점은</p>
      <h6>
        해외생활의 여파에서인지 가정에서 저의 행동은 큰 제약이 없었습니다.
        다만 어떠한 것이든 제 행동에 책임을 지게 하셨고, 성인 이후로는 제
        결정에 필요한 모든것(생활비, 전과 대비 기본 교육비) 은 저의 역량으로
        헤쳐나가도록 배웠습니다. 저의 모든 행동에 책임감이 실리다보니, 항상
        저의 행동이 불러올 여파를 생각 하고, 최선의 결과를 내도록
        노력합니다. 행여 그 과정이나 결과에 만족하지 못하더라도 추후에
        비슷한 상황에서의 같은 실수를 하지 않도록 성장의 발판으로 삼습니다.
        일례로, 늦은 시기에 공대로의 전과를 결정해 학교의 학업과 학원들 통한
        보조 교육을 병행하던 시기가 있었습니다. 시험 기간과 팀 프로젝트의
        일정이 겹쳤지만, 할 수 있을거란 과신하고 결국 팀 프로젝트의 끝맺음을
        짓지 못하고 끝난 적이 있습니다. 이에 따라 모든 일을 시작 할때에,
        조금은 도전적이지 못한 모습이 있습니다. 물론 그 이후로 모든
        프로젝트에서의 팀장을 맡으며 소통을 통해 실천 가능한 목표를 더블
        체크하며 성공적으로 완성 시키는 등 조금씩 도전정신을 찾아가고
        있습니다.
      </h6>
    </div>
    <div class="textbox">
      <p>동기 및 포부는..</p>
      <h6>
        본질을 신경 쓰되 시선은 넓고 멀리 보려 합니다. 중학생 때 2주간
        다녀왔던 게임 디자인 캠프와 컴퓨터 시간에 배웠던 스크래치 프로그램을
        통해 로직의 개념을 익혔습니다. 제가 건드린 블록 하나, 조건 하나에
        따라 무궁무진하게 변할 수 있음에 큰 흥미를 느낌과 동시에, 내부적으로
        어떠한 원리인지 너무나 궁금했습니다. 그렇게 의문을 남긴 채 개발자의
        꿈을 가지게 되니 항상 이용하는 사이트나 즐겨하는 게임의 내부를 알게
        될 수 있다는 사실에 더욱 설렜고, 백엔드와 데이터 처리과정을 중점으로
        수강하였습니다. 이러한 경험과 저의 흥미는 해당 직무에 있어 발전적인
        가속도를 낼 수 있을 거라 생각합니다.더욱이 장기적으로 선배님들이
        깔아 놓으신 기반을 발판 삼아 빠르게 흡수하고 때로는 조커가 되고
        때로는 버팀목이 되어 궁극적으로 세계에 진출 하게 될 때에 그 역할이
        중 했으면 합니다.
      </h6>
    </div>
  </article>
  )
}

export default Aboutme